; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite6 - satellite
	instrument10 - instrument
	satellite7 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	satellite8 - satellite
	instrument14 - instrument
	instrument15 - instrument
	instrument16 - instrument
	image1 - mode
	spectrograph0 - mode
	thermograph3 - mode
	spectrograph2 - mode
	Star1 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph0)
	(supports instrument2 thermograph3)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument3 image1)
	(supports instrument3 thermograph3)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet5)
	(supports instrument4 spectrograph0)
	(supports instrument4 image1)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 spectrograph2)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet9)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star1)
	(supports instrument7 image1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet5)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 Star1)
	(supports instrument9 spectrograph0)
	(supports instrument9 spectrograph2)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 GroundStation3)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star6)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 GroundStation0)
	(on_board instrument10 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Planet8)
	(supports instrument11 spectrograph2)
	(supports instrument11 thermograph3)
	(calibration_target instrument11 GroundStation3)
	(supports instrument12 spectrograph2)
	(supports instrument12 image1)
	(supports instrument12 spectrograph0)
	(calibration_target instrument12 GroundStation3)
	(supports instrument13 spectrograph2)
	(supports instrument13 spectrograph0)
	(supports instrument13 image1)
	(calibration_target instrument13 GroundStation0)
	(on_board instrument11 satellite7)
	(on_board instrument12 satellite7)
	(on_board instrument13 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Planet9)
	(supports instrument14 thermograph3)
	(supports instrument14 image1)
	(calibration_target instrument14 GroundStation3)
	(supports instrument15 spectrograph0)
	(supports instrument15 image1)
	(supports instrument15 spectrograph2)
	(calibration_target instrument15 GroundStation2)
	(supports instrument16 spectrograph2)
	(supports instrument16 thermograph3)
	(supports instrument16 spectrograph0)
	(calibration_target instrument16 GroundStation4)
	(on_board instrument14 satellite8)
	(on_board instrument15 satellite8)
	(on_board instrument16 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Phenomenon10)
)
(:goal (and
	(pointing satellite3 Planet8)
	(pointing satellite4 Phenomenon10)
	(pointing satellite7 Star7)
	(have_image Planet5 image1)
	(have_image Star6 spectrograph0)
	(have_image Star7 spectrograph2)
	(have_image Planet8 spectrograph2)
	(have_image Planet9 spectrograph0)
	(have_image Phenomenon10 spectrograph2)
))

)

; plan
1. (turn_to satellite7 groundstation3 planet9)
   deleted: (pointing satellite7 planet9)
   added: (pointing satellite7 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument12 satellite7)
   deleted: (power_avail satellite7)
   added: (power_on instrument12)
   goals met: 0 of 9
3. (calibrate satellite7 instrument12 groundstation3)
   added: (calibrated instrument12)
   goals met: 0 of 9
4. (turn_to satellite7 planet8 groundstation3)
   deleted: (pointing satellite7 groundstation3)
   added: (pointing satellite7 planet8)
   goals met: 0 of 9
5. (take_image satellite7 planet8 instrument12 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 1 of 9
6. (turn_to satellite7 planet5 planet8)
   deleted: (pointing satellite7 planet8)
   added: (pointing satellite7 planet5)
   goals met: 1 of 9
7. (take_image satellite7 planet5 instrument12 image1)
   added: (have_image planet5 image1)
   goals met: 2 of 9
8. (turn_to satellite7 phenomenon10 planet5)
   deleted: (pointing satellite7 planet5)
   added: (pointing satellite7 phenomenon10)
   goals met: 2 of 9
9. (turn_to satellite4 phenomenon10 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 phenomenon10)
   goals met: 3 of 9
10. (turn_to satellite3 planet8 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 planet8)
   goals met: 4 of 9
11. (take_image satellite7 phenomenon10 instrument12 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 5 of 9
12. (turn_to satellite7 planet9 phenomenon10)
   deleted: (pointing satellite7 phenomenon10)
   added: (pointing satellite7 planet9)
   goals met: 5 of 9
13. (take_image satellite7 planet9 instrument12 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 6 of 9
14. (turn_to satellite7 star6 planet9)
   deleted: (pointing satellite7 planet9)
   added: (pointing satellite7 star6)
   goals met: 6 of 9
15. (take_image satellite7 star6 instrument12 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 7 of 9
16. (turn_to satellite7 star7 star6)
   deleted: (pointing satellite7 star6)
   added: (pointing satellite7 star7)
   goals met: 8 of 9
17. (take_image satellite7 star7 instrument12 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 9 of 9
